Конфигурация отчетов/Documents/ДобавитьСвязьОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДобавитьСвязьОбъектов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РодительЗадачи</xr:Item>
				<xr:Item>InformationRegister.СвязьОбъектов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/ДобавитьСвязьОбъектов/Ext/ManagerModule.bsl
Функция СоздатьСвязьОбъектов(Родитель, Подчиненный) Экспорт 
	
	Док = Документы.ДобавитьСвязьОбъектов.СоздатьДокумент();
	Док.Дата        = ТекущаяДата();
	Док.Родитель    = Родитель; 
	Док.Задача = Подчиненный;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Док.Ссылка;
	
КонецФункции         

Функция ЗаписатьРодителя(Задача, Родитель) Экспорт 
	
	Док = Документы.ДобавитьСвязьОбъектов.СоздатьДокумент();
	Док.Дата        = ТекущаяДата();
	Док.Родитель    = Родитель; 
	Док.Задача = Задача;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Док.Ссылка;
	
КонецФункции
